SPedt/src/Documents/Приходная/Приходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Приходная</name>
  <registerRecords>InformationRegister.УдалитьПокупкиОтдельнымМестом</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыВПосылках</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНаСкладе</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>InformationRegister.ДанныеЗаказовСайт</registerRecords>
  <registerRecords>InformationRegister.ШтрафныеЗаказы</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>InformationRegister.ДанныеЗаказов</registerRecords>
  <registerRecords>InformationRegister.ОчередьРазбора</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.НеВыгруженноНаСайт</registerRecords>
  <registerRecords>InformationRegister.УдалитьНегабаритЗначения</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.Приход</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОборотнаяТараДвижение</registerRecords>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Транзит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>МультиОрг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыПриходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДелаемГрупповойСтикер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <comment>Номер покупки</comment>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Пристрой</types>
        <types>CatalogRef.СобранныеЗаказы</types>
        <types>Number</types>
        <types>CatalogRef.Коробки</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОргСбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <comment>Размер покупки</comment>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПокупки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предупреждение</name>
      <type>
        <types>EnumRef.ПредупрежденияПрихода</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Посылки</name>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборотнаяТара</name>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.ОборотнаяТара</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/CommonModules/аСППрив/Module.bsl
#Область ПрограммнфйИнтерфейс
//Используется в регламентном задании "Загрузка с сайта"
//аналогичная процедура в Обработке ЗагрузкаССайта ЗагрузкаNew(Команда)
Процедура ВыполнитьЗагрузкуССайта()  Экспорт
	ЗагрузкаСправочников 		= Документы.СинхронизацияСправочников.СоздатьДокумент();
	ЗагрузкаСправочников.ЗаполнитьПеродыЗагрузки();
	ЗагрузкаСправочников.Дата	= ТекущаяДата();
	ЗагрузкаСправочников.ЗагрузитьСправочники();
	Попытка
		ЗагрузкаСправочников.Записать(РежимЗаписиДокумента.Проведение)
	Исключение
	    ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	
	
	
	//ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	//
	//АнтейТранзит = Справочники.ТочкиРаздачи.НайтиПоКоду("0039");
	//Если Константы.СвояТочка.Получить() <> АнтейТранзит Тогда
	//	ЗаказовНаТранзите = СтоСПОбмен_ЗаказыНаТранзите.Получить(АнтейТранзит);
	//	константы.ЗаказовНаТранзите.Установить("На транзите " + Строка(ЗаказовНаТранзите) + " шт , на "+ ТекущаяДата());
	//	//СП_ПокупкиВПути.ЗагрузитьВыехавшиеТранзиты();
	//	
	//КонецЕсли;
	//СтоСПОбмен_ПокупкиВПути.Получить();
	//
	//аспПроцедурыОбменаДанными.ПолучитьССайта();
	//
	//#Область СупперГруппыПоДате
	//стрОтвета 					= СтоСПОбмен_СупперГруппы.Загрузить_СуперГруппыПоДате();
	//#КонецОбласти 
	//
	//аспПроцедурыОбменаДанными.ДогрузитьСправочникиССайта();

КонецПроцедуры	



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура  ЗапуститьВосстановлениеТранзита() Экспорт
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();

	ЗаписьЖурналаРегистрации("Восстановление транзита",,,,"Запуск !!!",);
	//ПараметрыСеанса.глОбработкаПерепроведения_ВосстановлениеСерий = Ложь;
	НачПериодаТранзит =НачалоДня(Последовательности.Транзит.ПолучитьГраницу().Дата-60*60*24);
	КонПериода=НачалоДня(ТекущаяДата())-1;
	Пока НачПериодаТранзит<=КонПериода Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Приходная.Ссылка
		|ИЗ
		|	Документ.Приходная КАК Приходная
		|ГДЕ
		|	Приходная.Проведен
		|	И Приходная.Дата МЕЖДУ &НачалоДня И &КонецДня
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РазборКоробки.Ссылка
		|ИЗ
		|	Документ.РазборКоробки КАК РазборКоробки
		|ГДЕ
		|	РазборКоробки.Дата МЕЖДУ &НачалоДня И &КонецДня
		|	И РазборКоробки.Проведен";
		
		Запрос.Параметры.Вставить("НачалоДня",НачалоДня(НачПериодаТранзит));
		Запрос.Параметры.Вставить("КонецДня",КонецДня(НачПериодаТранзит));
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий()  Цикл
			об = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Попытка
				об.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ЗаписьЖурналаРегистрации("Восстановление транзита",,,,"Ошибка !!!"+ОписаниеОшибки(),);
			КонецПопытки;
		КонецЦикла;
			
		НачПериодаТранзит=НачПериодаТранзит+24*60*60;
		Последовательности.Транзит.УстановитьГраницу(КонецДня(НачПериодаТранзит),);
		ЗаписьЖурналаРегистрации("Восстановление транзита",,,,"подвинулись на "+КонецДня(НачПериодаТранзит),);
	КонецЦикла;
КонецПроцедуры





Процедура ВыполнитьВыгрузкунаСайт() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	
	СтоСПОбмен_Посылки.ВыгрузитьНеВыгруженныеПосылки();
	
	аспПроцедурыОбменаДанными.ОтправитьНеОтправленныеПакеты();
	СтоСПФоновые.Запустить_Выгрузку_100СП();
	аспПроцедурыОбменаДанными.СформироватИОтправитьПакет();
	
	
КонецПроцедуры	



Процедура ПодпискаНаСобытие1ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//Если источник
	
КонецПроцедуры

Процедура ЭкспортОценкиПроизводительности() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры


//РегламентноеЗадание
Процедура ЗагрузкаГруппДоставки(ДатаЗагрузки=неопределено) Экспорт
	Если Константы.ИспользоватьТранспортныеКомпании.Получить() Тогда
		Результат	= СтоСПОбмен_ГруппыДоставки.Получить_ПоДате(ДатаЗагрузки);
		
		
		СтоСПОбмен_ГруппыДоставки.ПолучитьГруппыДоставкиСпризнаком_Догрузить();
		
		СтоСПОбмен_ГруппыДоставки.ВыгрузитьИзмененияНаСайт();
		
		СтоСП_ГруппыДоставки.РасчитатьОстаткиПоГруппамДоставки();
		
		Если Результат.ВсегоГруппОбработано>0  Тогда
			ПараметрыСеанса.ЗапуститьУчетГруппДоставки=Истина;	
		КонецЕСли;
	КонецЕСли;
КонецПроцедуры	

Процедура ЗагрузкаКурьерской(ДатаЗагрузки=неопределено) Экспорт
	Если Константы.КурьерскаяДоставка.Получить() Тогда
		массГрупп	= СП_КурьерскаяДоставка.Получить_ПоДате(ДатаЗагрузки);
		
		
		СП_КурьерскаяДоставка.ПолучитьДоставкиСпризнаком_Догрузить();
		//	СтоСПОбмен_ГруппыДоставки.ВыгрузитьИзмененияНаСайт();
		
		//СтоСП_ГруппыДоставки.РасчитатьОстаткиПоГруппамДоставки();	
		//Если массГрупп.Количество()>0  Тогда
		//	ПараметрыСеанса.ЗапуститьУчетГруппДоставки=Истина;	
		//КонецЕСли;	
	КонецЕсли;
КонецПроцедуры	




Процедура ОтчетПоБесплатнойВыдаче_Отправить_РегЗадание() Экспорт
	отправлятьОтчет = Константы.БесплатнаяВыдачаОтправлятьОтчет.Получить() или Константы.РазборНаЕРЦОтправлятьОтчет.Получить();
	
	Если не отправлятьОтчет Тогда Возврат; КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтчетБухгалтеру.Дата КАК ПериодОтчета,
		|	ОтчетБухгалтеру.Ссылка КАК Документ,
		|	ОтчетБухгалтеру.Проведен
		|ИЗ
		|	Документ.ОтчетБухгалтеру КАК ОтчетБухгалтеру
		|ГДЕ
		|	ОтчетБухгалтеру.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
	Запрос.УстановитьПараметр("НачалоПериода", 		КонецМесяца(НачалоГода(ТекущаяДата())-1));
	Запрос.УстановитьПараметр("ОкончаниеПериода", 	КонецГода(ТекущаяДата()));
	РезультатЗапроса 		= Запрос.Выполнить();
	тзСформированныеОтчеты 	= РезультатЗапроса.Выгрузить();  

	массНеПроведенныеОтчеты = тзСформированныеОтчеты.НайтиСтроки(новый Структура("Проведен",Ложь));

	Для Каждого элем Из массНеПроведенныеОтчеты Цикл
		док = элем.Документ.ПолучитьОбъект();
		док.СохранитьОтправитьФайлыОтчетов(док.Дата);
		Попытка
			док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ДатаОтчета = КонецМесяца(НачалоГода(ТекущаяДата())-1);
	Пока ДатаОтчета < ТекущаяДата()  Цикл 
		массСтрок = тзСформированныеОтчеты.НайтиСтроки(новый Структура("ПериодОтчета",ДатаОтчета));
		Если массСтрок.Количество() = 0 Тогда
			новыйДокумент = Документы.ОтчетБухгалтеру.СоздатьДокумент();
			новыйДокумент.СохранитьОтправитьФайлыОтчетов(ДатаОтчета);
			Попытка
				новыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				
			КонецПопытки;
		КонецЕсли;
		ДатаОтчета = КонецМесяца(ДатаОтчета+1);
	КонецЦикла;
КонецПроцедуры	



#КонецОбласти
